---
kind: method
id: M:Autodesk.Revit.DB.ParameterElement.GetDefinition
source: html/ec9b3cd3-4379-6eb8-7c7d-c220ba03f359.htm
---
# Autodesk.Revit.DB.ParameterElement.GetDefinition Method

Get the definition representing this parameter element.

## Syntax (C#)
```csharp
public InternalDefinition GetDefinition()
```

## Returns
The parameter.